[
    {
        "id": 1,
        "html_elements": "A closing tag, some content, and a starting tag make up an HTML element. The root element of an HTML document is the tag that defines the entire HTML document. Both opening and closing tags are in HTML format. Then inside the html element is the body element. The body of the document is defined by elements. A body tag appears at the start and a body tag appears at the conclusion. This element is empty and lacks a closing tag, yet it defines a line breaking. Hypertext makeup language tags are not case sensitive.",
        "html_headings": "Elements h1 through h6 in HTML are used to provide headers.The most important headings are marked with h1. h6 indicates the least relevant heading.The width and height attributes that specify the width of headers must also be included in the tag.Headers are used by search engines to index the layout and content of web pages.Users frequently seek for headers on webpages. To make the page's structure very obvious, utilise headings.H1 headings should be used as the first major heading, followed by H2 headings, H3 headings, and so on.",
        "html_images": "Your web sites' look and style may be improved using images.HTML image syntax HTML tags are used to embed images in web pages.Technically, the image is not upload into the web page. Images are connected to websites. The tag genrates a reference image location. The tag is empty, contains only attributes, and has no closing tag.Two qualities are necessary for a tag.defines the image's source code src. Alt - provides the image's alternative text.origin attribute The path URL to the picture is specified by the necessary src property. property alt The required alt property provides alternate text for the image in case the user is unable to view it owing to a slow connection, a problem with the src element, or because they are using a screen reader.",
        "html_form": "Usually, a server receives user input to process it. HTML forms for user input are created using the HTML form element. The element serves as a container for several input element kinds, including text boxes, check boxes, radio switch, and submit switch. The type property determines the element's possible appearances in various contexts. This feature is advantageous for screen reader users since the screen reader reads the label while the user focusses on the input element. Additionally, this component aids users who have trouble clicking on tiny locations (such tick boxes and radio switch). This is because a radio button or check box toggles when a user clicks on the content included within an element. There must be a match between the for and id attributes of the input tag. their connecting factors. Define an optional field. Radio switch allow the user to select one from a limited number of options. Checkboxes allow the user to select zero or more options from a limited set of options. Establishes a switch that sends form input to a form handler. Typically, a form handler is a file on a server that contains scripts that handle input data. The action property of the form is where form handlers are defined.",
        "frist_image":"https://i.ibb.co/xf0WdwH/rishitech1.png",
        "second_image":"https://i.ibb.co/z6gmq5V/rishi2.png",
        "third_image":"https://i.ibb.co/Rj5fJjz/heading.png",
        "four_image":"https://i.ibb.co/zfK7kMZ/studentname.png",
        "five_image":"https://i.ibb.co/kKpTj2G/form2.png"
    }
]