[
    {
        "id": 1,
        "java_intro": "Programming language JavaScript. The programming language used for web applications is called JavaScript. Learning JavaScript is easy. In this tutorial, you'll learn JavaScript from basic to advanced. Variables are containers for storing data. JavaScript variables can be declared in three ways: 1.variable, 2.let me, 3.const.JS variables must be identified by a unique name. These unique names said to be identifiers. JavaScript is case sensitive.",
        "java_es": "The let keyword is used in ES6. let cannot be redeclared. let must be declared before use. let have block scope. let should not be redeclared. Block size. Prior to ES6 2015, JavaScript had global scope and functionality. All they do is let and const. These two keywords in JavaScript offer block scoping. The declared variables in a block are not accessible from outside the block.",
        "java_co": "The const using in ES6. const cannot be redeclared. const not be reassigned. const have block scope. const variables cannot be reassigned. Always declare a variable as const if you know the value should not change.Use const when declaring: new array, new object.",
        "java_fun": "A small piece of code called a JavaScript function is used to accomplish a certain task. The function keyword, brackets (), and a name are used to define functions in JavaScript. Like variable names, function names can also contain characters, numbers, underscores, and dollar signs.Parentheses can contain parameter names separated by commas.(parameter 1, parameter 2, parameter 3, parameter 4 ...).The code executed by the function is enclosed in curly braces. Function parameters are listed within parentheses () in the function definition. Function arguments were the values given to a function when it is recalled. Inside a function, arguments (parameters) behave like local variables. Function execution stops when the JavaScript reaches the return statement. JavaScript returns to run the code following the calling statement when a function is called from one. JavaScript object the following keywords. In a function definition, this refers to the owner of the function.",
        "java_set": "A collection of unique values is referred to as a javascript set. Each value in a set only appears once. Methods in Set: new set(): create a new set. add(): Add the new element in set. delete(): removes an element in set. has(): returns ture if a value exist in set. forEach(): invokes a callback for ecah element in set. values(): Returns an iterator with all the values.",
        "java_pro": "In js, a promise is a good way to handle asynchronous operations. It is used to determine whether or not the asynchronous operation was successful. A promise may have one of the three states: Pending, fulfilled, rejected. To create a Promise object, use the Promise () constructor. The Promise() constructor takes a function as an argument. This function also accepts two functions, resolve and reject. If the Promise successfully returns, the resolve function is called. When an error occurs, the reject function is called.",
        "java_jsn": "Data may be stored and sent using the JSON format. Data given from server to a web page is frequently sent in JSON format. Despite being a text-based format, Any programming language may be used to develop code that reads and produces JSON data.",
        "java_image":"https://i.ibb.co/vBzd5sJ/Untitled-designfun.png",
        "java_image2":"https://i.ibb.co/47zL4Vk/array.png",
        "java_image3":"https://i.ibb.co/1ryrs2f/json.png"
        
    }
]